Documents/ВыполнениеЗаявкиНаАрендуПП_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВыполнениеЗаявкиНаАрендуПП_ат</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаНаАрендуПП_ат</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.АрендаПП_ат</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаАрендуПП_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ДействиеПоЗаявкеНаАрендуПП_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Договоры_ат</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тикет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Поставки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПродуктДляАренды</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПродуктыДляАренды_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставщик</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Поставка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПоставкиПродуктов_ат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/ТипыДоговоров_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыДоговоров_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>АрендаПрограммныхПродуктов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АрендаСерверов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Интернет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обслуживание</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаПрограммныхПродуктов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПродажаТоваров</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Разработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Телефония</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Хостинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЭДО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочее</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыСтатусовЗаявокНаАренду_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>ТипыСтатусовЗаявокНаАренду_ат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаРассмотрении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОжиданиеОплаты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИсполненаСИзменениями</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаТехническомСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаФинансовомСогласовании</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ВыполнениеЗаявкиНаАрендуПП_ат/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоставкиПоставкаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//+ Grig 24.05.2016 закомментировал т.к. не работало и приводило к записи дампа.
	
	//// Вставить содержимое обработчика.
	//СтандартнаяОбработка = ложь;
	//Если Объект.ДокументОснование.Пустая() тогда
	//	сообщение = новый СообщениеПользователю;
	//	сообщение.Поле = "Объект.ДокументОснование";
	//	сообщение.Текст = "Поле документа основания должно быть заполнено!";
	//	сообщение.Сообщить();
	//	
	//Иначе
	//	
	//отбор = Новый Структура;
	//отбор.Вставить("ПометкаУдаления", Ложь);
	//отбор.Вставить("ПродуктДляАренды",Элемент.Родитель.ТекущиеДанные.ПродуктДляАренды);
	//
	//ПараметрыФормы = Новый Структура;
	//ПараметрыФормы.Вставить("РежимВыбора",Истина);
	//ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Истина);
	//ПараметрыФормы.Вставить("Отбор",отбор);
	//
	//
	//Форма = ПолучитьФорму("Документ.ВыполнениеЗаявкиНаАрендуПП_ат.Форма.ФормаОтбора",ПараметрыФормы,Элемент);
	//// Форма.Элементы.Список.отображение = ОтображениеТаблицы.Список; 
	//// какого-то хрена в иерархии список пустой... 16.12.2014.
	//Форма.Открыть();
	
	////ОткрытьФорму("Документ.ВыполнениеЗаявкиНаАрендуПП_ат.Форма.ФормаОтбора",ПараметрыФормы,Элемент);
	//		
	//КонецЕсли;
	
	//- Grig 24.05.2016
	
КонецПроцедуры

&НаКлиенте
Процедура ПродуктНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = ложь;
	//Если Объект.ДокументОснование.Пустая() тогда
	//	сообщение = новый СообщениеПользователю;
	//	сообщение.Поле = "Объект.ДокументОснование";
	//	сообщение.Текст = "Поле документа основания должно быть заполнено!";
	//	сообщение.Сообщить();
	//	
	//Иначе
	//	
	//	//ПараметрыФормы = Новый Структура;
	//	//ПараметрыФормы.Вставить("РежимВыбора",Истина);
	//	//ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Истина);
	//	//ПараметрыФормы.Вставить("документ", Объект.ДокументОснование);
	//	//ОткрытьФорму("Документ.ВыполнениеЗаявкиНаАрендуПП_ат.Форма.ФормаВыбораПродукта", ПараметрыФормы, Элемент);
	//	
	//	///ОткрытьФорму("Справочник.Договоры_ат.Форма.ФормаСпискаИВыбора",ПараметрыФормы,Элемент);
	//	// стандартная форма не подходит, ибо в запросе списка присутствует сравнение двух справочников
	//	
	//КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = ложь;
	Если Объект.ДокументОснование.Пустая() тогда
		сообщение = новый СообщениеПользователю;
		сообщение.Поле = "Объект.ДокументОснование";
		сообщение.Текст = "Поле документа основания должно быть заполнено!";
		сообщение.Сообщить();
	ИначеЕсли Объект.Организация.Пустая() тогда
		сообщение = новый СообщениеПользователю;
		сообщение.Поле = "Объект.Организация";
		сообщение.Текст = "Поле ОРГАНИЗАЦИЯ должно быть заполнено!";
		сообщение.Сообщить();
		
		
	Иначе
		//отбор = Новый Структура;
		//отбор.Вставить("ТипДоговора", ВОЗРАТТипДоговораАПП());
		//отбор.Вставить("ВидДог", ВОЗРАТТипДоговораАПП());
		//отбор.Вставить("Владедец", Объект.Клиент);
		//отбор.Вставить("Родитель", Справочники.Договоры_ат.ПустаяСсылка());
		//отбор.Вставить("Родитель", NULL);
		
		отбор = Новый Структура;
		//отбор.Вставить("ТипДоговора", ВОЗРАТТипДоговораАПП());
		//отбор.Вставить("ТипДоговора", ПредопределенноеЗначение("Перечисление.ТипыДоговоров_ат.АрендаПрограммныхПродуктов"));
		отбор.Вставить("Организация", Объект.Организация);
		отбор.Вставить("Владелец", Объект.Клиент);
		//отбор.Вставить("Владедец", Объект.Клиент);
		//отбор.Вставить("Родитель", Справочники.Договоры_ат.ПустаяСсылка());
		//отбор.Вставить("Родитель", NULL);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("РежимВыбора",Истина);
		ПараметрыФормы.Вставить("ЗакрытьПриВыборе", Истина);
		ПараметрыФормы.Вставить("Отбор", отбор);
		ПараметрыФормы.Вставить("ТипДоговора", ПредопределенноеЗначение("Перечисление.ТипыДоговоров_ат.АрендаПрограммныхПродуктов"));
		
		
		//ПараметрыФормы.Вставить("ВидДог", ПредопределенноеЗначение("Перечисление.ТипыДоговоров_ат.АрендаПрограммныхПродуктов"));
		//ПараметрыФормы.Вставить("Организация", Объект.Организация);
		//ПараметрыФормы.Вставить("Контрагент",  Объект.Клиент);
		//ПараметрыФормы.Вставить("Родитель", Справочники.Договоры_ат.ПустаяСсылка());
		//ПараметрыФормы.Вставить("Родитель", NULL);
		//ПараметрыФормы.Вставить("Отбор", отбор);
		//ПараметрыФормы.Вставить("Владелец", Объект.Клиент);
		
		
		//		форма = ПолучитьФорму("ОбщаяФорма.ФормаВыбораДоговораПоТипу_ат",ПараметрыФормы,Элемент);
		форма = ПолучитьФорму("Справочник.Договоры_ат.ФормаВыбора",ПараметрыФормы,Элемент);
		
		// Форма.Открыть();
		// ОткрытьФорму("Документ.ВыполнениеЗаявкиНаАрендуПП_ат.Форма.ФормаВыбораДоговора",ПараметрыФормы,Элемент);
		//форма = ПолучитьФорму("Справочник.Договоры_ат.ФормаВыбора",ПараметрыФормы,Элемент);
		////Форма.Список.Ссылка.Установить("ТипДоговора", ВОЗРАТТипДоговораАПП());
		//Форма.список.
		Форма.Открыть();
		
		
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	ОрганизацияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОрганизацияПриИзмененииНаСервере()
	
	Объект.Договор = Неопределено;
	Для каждого стр из Объект.Поставки цикл
		стр.Поставка = Неопределено;	
		
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	Для каждого стр из Объект.Поставки цикл
		стр.Поставка = Неопределено;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	СтатусЗаявки = Аренда_ат.ПолучитьПоследнийСтатусЗаявки(Объект.ДокументОснование);
	
	Если СтатусЗаявки = 	Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ОжиданиеОплаты
		тогда
		КоманднаяПанель.ПодчиненныеЭлементы.Записать.Видимость = ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.Провести.Видимость = Истина;
		КоманднаяПанель.ПодчиненныеЭлементы.ПровестиИЗакрыть.Видимость = Истина;
		КоманднаяПанель.ПодчиненныеЭлементы.ПровестиИЗакрыть.КнопкаПоУмолчанию = Истина;
		
		
	ИначеЕсли СтатусЗаявки = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаРассмотрении
		или  	  СтатусЗаявки = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ВОбработке
		или       СтатусЗаявки = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаТехническомСогласовании
		или 	  СтатусЗаявки = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.НаФинансовомСогласовании
		тогда
		КоманднаяПанель.ПодчиненныеЭлементы.Записать.Видимость = Истина;
		КоманднаяПанель.ПодчиненныеЭлементы.Провести.Видимость = ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ПровестиИЗакрыть.Видимость = ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.Записать.КнопкаПоУмолчанию = Истина;
	Иначе 
		
		КоманднаяПанель.ПодчиненныеЭлементы.Записать.Видимость = ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.Провести.Видимость = ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.ПровестиИЗакрыть.Видимость = ложь;
		КоманднаяПанель.ПодчиненныеЭлементы.Закрыть.КнопкаПоУмолчанию = Истина;
		
	КонецЕсли;
КонецПроцедуры

//&НаСервере
//Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
//	
//	//ЗаписьСтатуса = РегистрыСведений.СтатусыЗаявокНаАренду_ат.СоздатьНаборЗаписей();
//	//ЗаписьСтатуса.Отбор.Заявка.Установить(ЭтотОбъект.ДокументОснование);
//	//
//	//НаборСведений = ЗаписьСтатуса.Добавить();
//	//НаборСведений.Заявка = ЭтотОбъект.ДокументОснование;
//	//НаборСведений.Период = ТекущаяДата();
//	//
//	//Если РежимЗаписиДокумента = РежимЗаписиДокумента.Запись и ЭтотОбъект.ПометкаУдаления = ложь тогда
//	//	НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ВОбработке;
//	//ИначеЕсли РежимЗаписиДокумента = РежимЗаписиДокумента.Запись и ЭтотОбъект.ПометкаУдаления = Истина тогда
//	//	НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.Отклонена;
//	//ИначеЕсли РежимЗаписиДокумента = РежимЗаписиДокумента.Проведение тогда 
//	//	НаборСведений.Статус = Перечисления.ТипыСтатусовЗаявокНаАренду_ат.ОжиданиеОплаты;
//	//КонецЕсли;	
//	//НаборСведений.Пользователь = Пользователи.ТекущийПользователь();
//	//НаборСведений.Регистратор = ЭтотОбъект;
//	//ЗаписьСтатуса.Записать(Истина);
//
//КонецПроцедуры
